app/views/clientes/index.html.erb

          <th><%= @cliente.calcula_pComisionista.round(2)%></th>
          <th><%= Recibo.where(:placas_recibo => Vehiculo.where(:credencialcliente_vehiculo => @cliente.credencial_cliente).pluck(:placas_vehiculo)).sum(:sobres_recibo) %></th>
---
SELECT SUM("recibos"."sobres_recibo") FROM "recibos" WHERE "recibos"."placas_recibo" IN (SELECT "vehiculos"."id" FROM "vehiculos" WHERE "vehiculos"."credencialcliente_vehiculo" = $1)  [["credencialcliente_vehiculo", "UBE284"]]

    <div class="offset-md-1">
      <% @vehiculo = Vehiculo.where(:credencialcliente_vehiculo => @cliente.credencial_cliente) %>
---
SELECT  "vehiculos".* FROM "vehiculos" WHERE "vehiculos"."credencialcliente_vehiculo" = $1 AND "vehiculos"."id" = $2 LIMIT $3  [["credencialcliente_vehiculo", "UBE284"], ["id", nil], ["LIMIT", 1]]