app/views/clientes/show.html.erb

      <tbody style="text-align:center">
        <% Vehiculo.where(:credencialcliente_vehiculo => @cliente.credencial_cliente).each do |vehiculo| %>
---
SELECT "vehiculos".* FROM "vehiculos" WHERE "vehiculos"."credencialcliente_vehiculo" = $1  [["credencialcliente_vehiculo", "UBE284"]]

          <td></td>
          <td><%= Recibo.where(:placas_recibo => vehiculo.placas_vehiculo).sum(:combustible_recibo) %></td>
---
SELECT SUM("recibos"."combustible_recibo") FROM "recibos" WHERE "recibos"."placas_recibo" = $1  [["placas_recibo", "ABC123"]]