app/views/vehiculos/index.html.erb

SELECT SUM("recibos"."combustible_recibo") FROM "recibos" WHERE "recibos"."placas_recibo" = $1  [["placas_recibo", "ABC123"]]
---
          <td></td>
          <td><%= Recibo.where(:placas_recibo => vehiculo.placas_vehiculo).sum(:combustible_recibo) %></td>