app/views/vehiculos/show.html.erb

SELECT "recibos".* FROM "recibos" WHERE "recibos"."placas_recibo" = $1  [["placas_recibo", "ABC123"]]
---
          </tr>
          <% Recibo.where(:placas_recibo => @vehiculo.placas_vehiculo).each do |recibo| %>