app/controllers/clientes_controller.rb

  def index
    @clientes = Cliente.all
---
SELECT "clientes".* FROM "clientes"

  def create
    @cliente = Cliente.new(cliente_params)

    respond_to do |format|
      if @cliente.save
---
INSERT INTO "clientes" ("credencial_cliente", "empresa_cliente", "responsable_cliente", "telefono_cliente", "email_cliente", "comisionista_cliente", "porcentage_cliente", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"

  def update
    respond_to do |format|
      if @cliente.update(cliente_params)
---
UPDATE "clientes" SET "email_cliente" = $1, "updated_at" = $2 WHERE "clientes"."id" = $3  [["email_cliente", "pepeortiz@uber.com"], ["updated_at", 2016-11-25 07:40:03 UTC], ["id", 1]]

  def destroy
    @cliente.destroy
---
DELETE FROM "clientes" WHERE "clientes"."id" = $1  [["id", 1]]

    def set_cliente
      @cliente = Cliente.find(params[:id])
---
SELECT  "clientes".* FROM "clientes" WHERE "clientes"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]