app/controllers/recibos_controller.rb

SELECT "recibos".* FROM "recibos"
---
  def index
    @recibos = Recibo.all

INSERT INTO "recibos" ("kmactual_recibo", "combustible_recibo", "sobres_recibo", "placas_recibo", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["kmactual_recibo", 100.0], ["combustible_recibo", 50.0], ["sobres_recibo", 5.0], ["placas_recibo", "BCD234"], ["created_at", 2016-11-18 09:46:07 UTC], ["updated_at", 2016-11-18 09:46:07 UTC]]
---
  def create
    @recibo = Recibo.new(recibo_params)
    @recibo.emailrepresentante_recibo = current_user.email
    @recibo.tercero_recibo = Vehiculo.where(:placas_vehiculo => @recibo.placas_recibo).first.tercero_vehiculo
    respond_to do |format|
      if @recibo.save

UPDATE "recibos" SET "sobres_recibo" = $1, "updated_at" = $2 WHERE "recibos"."id" = $3  [["sobres_recibo", 15.0], ["updated_at", 2016-11-18 08:41:54 UTC], ["id", 2]]
---
  def update
    respond_to do |format|
      if @recibo.update(recibo_params)

DELETE FROM "recibos" WHERE "recibos"."id" = $1  [["id", 1]]
---
  def destroy
    @recibo.destroy

SELECT  "recibos".* FROM "recibos" WHERE "recibos"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_recibo
      @recibo = Recibo.find(params[:id])