app/controllers/vehiculos_controller.rb

  def index
    @vehiculos = Vehiculo.all
---
SELECT "vehiculos".* FROM "vehiculos"

  def create
    @vehiculo = Vehiculo.new(vehiculo_params)

    respond_to do |format|
      if @vehiculo.save
---
INSERT INTO "vehiculos" ("placas_vehiculo", "marca_vehiculo", "modelo_vehiculo", "ano_vehiculo", "rendimientohistorico_vehiculo", "operador_vehiculo", "credencialcliente_vehiculo", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"

  def update
    respond_to do |format|
      if @vehiculo.update(vehiculo_params)
---
UPDATE "vehiculos" SET "operador_vehiculo" = $1, "updated_at" = $2 WHERE "vehiculos"."id" = $3  [["operador_vehiculo", "Poncho"], ["updated_at", 2016-11-25 06:24:45 UTC], ["id", 1]]

  def destroy
    @vehiculo.destroy
---
DELETE FROM "vehiculos" WHERE "vehiculos"."id" = $1  [["id", 6]]

    def set_vehiculo
      @vehiculo = Vehiculo.find(params[:id])
---
SELECT  "vehiculos".* FROM "vehiculos" WHERE "vehiculos"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]