app/views/recibos/show.html.erb

SELECT  "vehiculos".* FROM "vehiculos" WHERE "vehiculos"."placas_vehiculo" = $1 ORDER BY "vehiculos"."id" ASC LIMIT $2  [["placas_vehiculo", "ABC123"], ["LIMIT", 1]]
---
        <td>
          <%= Vehiculo.where(:placas_vehiculo => @recibo.placas_recibo).first.marca_vehiculo %>